jayis1/daily-ideas/systems/soc-devices/iono-pin/firmware/bridge/sdkconfig.defaults
# ESP-IDF sdkconfig defaults for Iono Pin ESP32-C3 bridge
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_MODE_STA=y
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_FREERTOS_HZ=1000